benchmark/results/run_20260123_224637/homepage.txt
Running 30s test @ http://127.0.0.1:8080/
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    24.33ms   21.71ms  64.34ms   34.68%
    Req/Sec     1.04k    50.77     1.17k    69.17%
  Latency Distribution
     50%   25.79ms
     75%   45.96ms
     90%   49.28ms
     99%   53.59ms
  124784 requests in 30.02s, 30.80MB read
Requests/sec:   4157.35
Transfer/sec:      1.03MB